#include "ad.h"
#include "LPC23xx.H"

//AD初始化
void AD_Init(void)
{
    PINSEL10 = 0;		    //禁止ETM
    PCONP |= (1<<12);       // AD外设ON	
    //硬件连接关系：AD0.0即P0.23接入热温电阻
	PINSEL1=(PINSEL1&0xFFFF3FFF)|0x00004000;     //P0.23功能设定为AD0.0
}

//获取AD采样结果
uint32_t AD_Get(void)
{
    uint32_t addata;
    AD0CR = 0x01000001 | 0x00200300;        // A/D: 10位 AD时钟为PCLK/(3+1)=12/4=3MHz 启动AD
    do {
        addata = AD0GDR;                    // 读AD全局寄存器
    } while ((addata & 0x80000000) == 0);   //  判断AD是否转换完成
    AD0CR &= ~0x01000001;                   // 停止AD运行
    addata = (addata >> 6) & 0x03FF;        //获取AD值
    return addata;
}


//10K的热敏电阻0-100度所对应的码表值
const unsigned  int Temp_code[]=
{
//	0-25
	2843,2718,2599,2486,2379,2277,2180,2087,1999,1916,1836,1760,1688,1619,1553,1490,1430,1373,1319,1266,1217,1169,1124,1081,1039,1000,
//	26--50
	962,925,891,857,826,795,766,738,711,686,661,638,615,593,573,553,534,515,497,480,464,449,433,419,405,
//	51-75
	392,379,366,355,343,332,321,311,301,292,283,274,265,257,249,242,234,227,220,214,208,201,195,190,184,
//	76--100
	179,174,169,164,159,155,150,146,142,138,134,131,127,124,120,117,114,111,108,105,102,100,97,94,92
};

/***********************************************************************
//查电阻值所对应的温度是多少
***********************************************************************/
uint8_t check_code(uint32_t k)
{
	unsigned char i;
	if(k<=92)return(100);	//大于100度以上都显示为100度
	for(i=0;k<Temp_code[i];i++);
	return (i-1);
	
}
 
/***********************************************************************
//R=30K或20K
//RT=10K
***********************************************************************/
uint32_t Totemp(uint32_t AD)
{	
	unsigned int Itemp;
	unsigned int Tk;
	Tk=1023-AD;

	Itemp=(uint32_t)(((uint32_t)1000*AD)/Tk);		//扩大100倍
	return(Itemp);
}

uint8_t  Get_Temp(uint32_t AD)
{
    return (check_code(Totemp(AD)));	//转换温度
}

